export const FeedExamples = [
  {
    id: 1,
    content: `오늘은 날씨가 맑아서 산책하기 좋았어요!
      아침 일찍 일어나서 공원으로 나갔는데, 상쾌한 공기와 함께 아름다운 풍경을 즐길 수 있었어요. 마음이 맑아지는 느낌이었어요. 다음에도 꼭 산책을 하고 싶어요!`,
    tag: "운동",
    createdTime: "2022-01-02",
    writer_name: "홍길동",
    image_urls: ["/img/image1.png"],
  },
  {
    id: 2,
    content: `맛있는 저녁 메뉴 추천해주세요!
      오늘은 무언가 특별한 음식을 먹고 싶어서 여러 가게를 찾아보고 있어요. 다양한 음식을 좋아하는데, 이번 주말에 친구들과 함께 맛집 투어를 계획 중이에요. 추천해주신다면 정말 감사할 거예요!`,
    tag: "음식",
    createdTime: "2022-01-03",
    writer_name: "이영희",
    image_urls: ["/img/image2.png"],
  },
  {
    id: 3,
    content: `여행을 다녀왔습니다. 이곳의 경치는 정말 멋있었어요!
      오랜만에 여행을 가서 기분이 너무 좋았어요. 여행지에서는 많은 사람들과 함께 아름다운 풍경을 감상하며 즐거운 시간을 보냈어요. 이번 여행은 오래 기억에 남을 것 같아요.`,
    tag: "여행",
    createdTime: "2022-01-04",
    writer_name: "박철수",
    image_urls: ["/img/image3.png"],
  },
  {
    id: 4,
    content: `오늘의 일기: 기분 좋은 하루였어요.
      오늘은 좋은 일이 연이어 일어나서 기분이 너무 좋아요. 아침부터 웃음 가득한 하루를 보내고, 좋은 소식을 듣고 기분이 한층 더 좋아졌어요. 이런 날이 더 많았으면 좋겠어요!`,
    tag: "일상",
    createdTime: "2022-01-05",
    writer_name: "김예린",
    image_urls: ["/img/image4.png"],
  },
  {
    id: 5,
    content: `이 책 정말 추천합니다. 꼭 읽어보세요!
      최근에 읽은 책 중에 너무 인상 깊은 책을 발견해서 소개해드리고 싶어요. 이 책은 생각할 거리를 많이 주는 내용으로 구성되어 있어서 많은 독자들의 호평을 받았어요. 저도 여러 번 읽으며 많은 영감을 받았답니다.`,
    tag: "도서",
    createdTime: "2022-01-06",
    writer_name: "정민우",
    image_urls: ["/img/image5.png"],
  },
  // 추가적인 요소들...
  {
    id: 6,
    content: `오늘은 나만의 작품을 완성했어요!
      오랜 기간 동안 창작한 작품을 마침내 완성했습니다. 저의 노력과 열정이 듬뿍 담긴 작품이라 자랑스럽고 기뻐요. 앞으로도 더욱 열심히 작업하며 성장해 나가고 싶어요!`,
    tag: "창작",
    createdTime: "2022-01-07",
    writer_name: "이지원",
    image_urls: ["/img/image6.png"],
  },
  {
    id: 7,
    content: `오늘은 새로운 취미를 시작했어요!
      지루한 일상에서 벗어나기 위해 새로운 취미를 찾아보았어요. 이번에 선택한 취미는 정말 재미있고 흥미로운 것 같아서 기대가 큽니다. 앞으로 많은 시간을 즐겁게 보낼 수 있을 것 같아요!`,
    tag: "취미",
    createdTime: "2022-01-08",
    writer_name: "김민준",
    image_urls: ["/img/image7.png"],
  },
  {
    id: 8,
    content: `오늘은 친구들과 함께 영화를 보았어요!
      오랜만에 친구들과 모여 영화를 관람했는데, 너무 재미있는 시간을 보냈어요. 웃고 울며 영화를 함께 감상하니 친구들과의 추억이 더욱 소중하게 느껴졌어요. 다음에도 같이 영화를 보러 가고 싶어요!`,
    tag: "영화",
    createdTime: "2022-01-09",
    writer_name: "박지우",
    image_urls: ["/img/image8.png"],
  },
  {
    id: 9,
    content: `오늘은 힘들었지만, 잘 해냈다는 느낌이 들어 기뻐요.
      오늘은 어려운 일이 있었는데, 노력 끝에 문제를 해결할 수 있었어요. 처음에는 어려워서 포기하려고 했지만, 계속 노력하니까 성공할 수 있었어요. 자신감이 생기는 좋은 경험이었습니다.`,
    tag: "성취",
    createdTime: "2022-01-10",
    writer_name: "김현아",
    image_urls: ["/img/image9.png"],
  },
  {
    id: 10,
    content: `오늘은 새로운 사람과의 만남이 있었어요!
      오늘은 새로운 사람과의 소중한 만남을 가졌어요. 서로 다른 배경과 경험을 가진 사람이라서 많은 이야기를 나눌 수 있었고, 새로운 시각과 인사이트를 얻을 수 있었어요. 다양한 사람들과 소통하며 세계를 넓히는 것이 참 흥미롭고 보람찬 일이에요!`,
    tag: "인연",
    createdTime: "2022-01-11",
    writer_name: "이승호",
    image_urls: ["/img/image10.png"],
  },
];

export const FundingExamples = [
  {
    id: 1,
    writer_name: "김철수",
    title: "음악 앨범 제작 펀딩",
    content: `안녕하세요, 저는 음악가로서 첫 번째 앨범을 제작하고자 하는 김철수입니다. 이 앨범은 내 진솔한 이야기와 감성적인 멜로디로 가득한 음악을 담고 있을 것입니다. 많은 사람들에게 나의 음악을 전할 수 있도록 펀딩을 시작하려고 합니다.
  
      이 펀딩은 앨범 제작과 관련된 비용을 마련하기 위해 시작되었습니다. 녹음 스튜디오 비용, 음악 프로듀서 고용, 음원 마스터링 등에 사용될 예정입니다. 저의 음악에 관심이 있으신 분들의 많은 참여를 부탁드립니다.`,
    tag: "음악",
    request_num: 100,
    created_time: "2022-01-01",
    finished_time: "2022-02-28",
    influencer: "김철수",
    image_urls: ["/img/image1.png"],
  },
  {
    id: 2,
    writer_name: "이영희",
    title: "지구를 위한 친환경 제품 개발 펀딩",
    content: `안녕하세요, 저는 지구를 보호하고자 친환경 제품을 개발하려는 이영희입니다. 현재 많은 환경 오염 문제가 발생하고 있어서 이를 해결하기 위한 친환경 제품 개발에 힘쓰고 있습니다.
  
      이 펀딩은 친환경 제품 개발과 관련된 비용을 마련하기 위해 시작되었습니다. 연구 및 개발 비용, 재료 구매, 생산 설비 구축 등에 사용될 예정입니다. 지구를 함께 지키기 위해 많은 분들의 관심과 참여를 부탁드립니다.`,
    tag: "환경보호",
    request_num: 50,
    created_time: "2022-01-02",
    finished_time: "2022-03-31",
    influencer: "이영희",
    image_urls: ["/img/image2.png"],
  },
  {
    id: 3,
    writer_name: "박영수",
    title: "농촌 체험 프로그램 개설 펀딩",
    content: `안녕하세요, 저는 도시 생활에 지친 사람들을 위해 농촌 체험 프로그램을 개설하고자 하는 박영수입니다. 도시와는 다른 자연의 아름다움과 농업 경험을 통해 사람들에게 소중한 경험을 제공하고자 합니다.
  
      이 펀딩은 농촌 체험 프로그램 개설을 위해 필요한 예산을 마련하기 위해 시작되었습니다. 농장 임대비, 체험 활동 준비물 구입, 인력 고용 등에 사용될 예정입니다. 도시 생활에 지친 분들에게 새로운 경험을 제공하기 위해 많은 관심과 참여 부탁드립니다.`,
    tag: "여가",
    request_num: 30,
    created_time: "2022-01-03",
    finished_time: "2022-04-30",
    influencer: "박영수",
    image_urls: ["/img/image3.png"],
  },
  {
    id: 4,
    writer_name: "정민지",
    title: "동물 보호소 지원 펀딩",
    content: `안녕하세요, 저희는 유기 동물들을 보호하고 새로운 가족을 찾아주는 보호소를 운영하고 있습니다. 유기 동물들은 많은 도움이 필요한 상황이기 때문에 보호소 운영을 위한 지원이 중요합니다.
  
      이 펀딩은 보호소 운영을 위해 필요한 경비를 마련하기 위해 시작되었습니다. 동물 사료 구매, 의료 비용, 보호소 시설 유지 보수 등에 사용될 예정입니다. 유기 동물들에게 새로운 기회를 제공하기 위해 많은 관심과 참여를 부탁드립니다.`,
    tag: "사회복지",
    request_num: 20,
    created_time: "2022-01-04",
    finished_time: "2022-05-31",
    influencer: "정민지",
    image_urls: ["/img/image4.png"],
  },
  {
    id: 5,
    writer_name: "이준호",
    title: "영화 제작 프로젝트 펀딩",
    content: `안녕하세요, 저희는 독립 영화를 제작하기 위한 펀딩을 시작하려고 합니다. 이 영화는 일상에서 놓치기 쉬운 감동과 이야기를 담고 있으며, 작은 사람들의 이야기를 통해 사회적인 문제를 다룹니다.
  
      이 펀딩은 영화 제작을 위해 필요한 예산을 마련하기 위해 시작되었습니다. 촬영 장비 대여, 스태프 비용, 포스터 및 홍보 자료 제작 등에 사용될 예정입니다. 작은 이야기로 큰 감동을 전할 수 있도록 많은 관심과 참여를 부탁드립니다.`,
    tag: "영화",
    request_num: 50,
    created_time: "2022-01-05",
    finished_time: "2022-06-30",
    influencer: "이준호",
    image_urls: ["/img/image5.png"],
  },
  {
    id: 6,
    writer_name: "김지현",
    title: "장애인 스포츠 지원 펀딩",
    content: `안녕하세요, 저희는 장애인들이 다양한 스포츠 활동을 할 수 있도록 지원하는 프로그램을 운영하고 있습니다. 스포츠는 모두가 참여할 수 있는 활동이어야 하기 때문에 장애인들의 권리를 지키기 위해 노력하고 있습니다.
  
      이 펀딩은 장애인 스포츠 지원을 위해 필요한 예산을 마련하기 위해 시작되었습니다. 운동장 임대비, 장애인용 스포츠 용품 구입, 강사 고용 등에 사용될 예정입니다. 모두가 스포츠를 즐길 수 있는 사회를 만들기 위해 많은 관심과 참여를 부탁드립니다.`,
    tag: "장애인",
    request_num: 30,
    created_time: "2022-01-06",
    finished_time: "2022-07-31",
    influencer: "김지현",
    image_urls: ["/img/image6.png"],
  },
  {
    id: 7,
    writer_name: "박민우",
    title: "청소년 교육 지원 펀딩",
    content: `안녕하세요, 저희는 청소년들의 교육을 지원하기 위한 프로그램을 개발하고 있습니다. 청소년들은 미래의 주역으로서 발전할 수 있는 환경과 교육을 받아야 합니다. 저희 프로그램은 그러한 목표를 이루기 위해 시작되었습니다.
  
      이 펀딩은 청소년 교육 프로그램 개발을 위해 필요한 예산을 마련하기 위해 시작되었습니다. 교재 구매, 교육 장비 구입, 강사 고용 등에 사용될 예정입니다. 청소년들의 꿈을 키우기 위해 많은 관심과 참여를 부탁드립니다.`,
    tag: "교육",
    request_num: 20,
    created_time: "2022-01-07",
    finished_time: "2022-08-31",
    influencer: "박민우",
    image_urls: ["/img/image7.png"],
  },
  {
    id: 8,
    writer_name: "김수민",
    title: "여성 일자리 창출 펀딩",
    content: `안녕하세요, 여성 일자리 창출을 위한 사회적 기업을 운영하고 있는 김수민입니다. 여성들에게 경제적인 독립과 사회 진출 기회를 제공하기 위해 다양한 프로젝트를 진행하고 있습니다.
  
      이 펀딩은 여성 일자리 창출 프로젝트를 위해 필요한 예산을 마련하기 위해 시작되었습니다. 직업 교육 비용, 직무 훈련 지원, 창업 지원 등에 사용될 예정입니다. 여성의 경제적 자립을 위해 많은 관심과 참여를 부탁드립니다.`,
    tag: "사회복지",
    request_num: 30,
    created_time: "2022-01-08",
    finished_time: "2022-09-30",
    influencer: "김수민",
    image_urls: ["/img/image8.png"],
  },
  {
    id: 9,
    writer_name: "박지훈",
    title: "사회적 약자 지원 펀딩",
    content: `안녕하세요, 저희는 사회적으로 약한 계층을 위한 지원 프로그램을 운영하고 있습니다. 저소득층, 노인, 장애인 등 다양한 사회적 약자들이 보다 풍요롭고 안정된 삶을 영위할 수 있도록 도움을 주고자 합니다.
  
      이 펀딩은 사회적 약자 지원을 위해 필요한 예산을 마련하기 위해 시작되었습니다. 생필품 지원, 의료 비용 지원, 교육 지원 등에 사용될 예정입니다. 사회적으로 취약한 분들을 돕기 위해 많은 관심과 참여를 부탁드립니다.`,
    tag: "사회복지",
    request_num: 20,
    created_time: "2022-01-09",
    finished_time: "2022-10-31",
    influencer: "박지훈",
    image_urls: ["/img/image9.png"],
  },
  {
    id: 10,
    writer_name: "김서연",
    title: "문화 예술 프로젝트 펀딩",
    content: `안녕하세요, 저희는 다양한 예술 분야의 창작가들을 지원하고 문화 예술 활동을 발전시키기 위한 펀딩을 시작하려고 합니다. 예술은 우리 사회의 풍요로움과 아름다움을 창출하는 중요한 요소입니다.
  
      이 펀딩은 문화 예술 프로젝트를 위해 필요한 예산을 마련하기 위해 시작되었습니다. 창작 활동 지원, 공연 장소 대여, 예술가 지원 등에 사용될 예정입니다. 문화 예술 분야의 발전을 위해 많은 관심과 참여를 부탁드립니다.`,
    tag: "문화",
    request_num: 40,
    created_time: "2022-01-10",
    finished_time: "2022-11-30",
    influencer: "김서연",
    image_urls: ["/img/image10.png"],
  },
  // 추가적인 요소들...
];

export const messagesAboutFundingExamples = [
  [
    {
      name: "팬1",
      message: "이 유튜버 저도 너무 좋아해요!! 펀딩 요청하는 거 어떠신가요??",
    },
    {
      name: "그림초보",
      message:
        "헉.. 저 말고도 이 유튜버 따라 그리고 싶으신 분이 있으셨다니..! 당장 진행시켜~",
    },
  ],
  [
    {
      name: "그림마스터",
      message: "펀딩 참여하면 이 그림 그리는 방법도 알려주실 건가요?",
    },
    { name: "팬4", message: "저도 굿즈 사고 싶어요! 펀딩 참여하겠습니다." },
  ],
  [
    { name: "팬7", message: "펀딩이 시작되면 바로 알려주세요!" },
    {
      name: "그림전문가",
      message: "이런 좋은 기회를 제공해주셔서 감사합니다.",
    },
  ],
  [
    {
      name: "팬10",
      message: "펀딩으로 더 많은 사람들이 이 작품을 알게 되었으면 좋겠습니다.",
    },
    { name: "팬11", message: "펀딩 참여하면 어떤 굿즈를 받을 수 있는 건가요?" },
  ],
];

export const messagesExamples = [
  [
    { name: "팬2", message: "펀딩에 참여하고 싶어요! 언제부터 시작하나요?" },
    {
      name: "유튜버",
      message: "펀딩 계획에 대해 많이들 기대하시는군요! 준비하도록 하겠습니다.",
    },
    { name: "팬3", message: "펀딩으로 굿즈도 만들어 주시면 좋겠어요!" },
  ],
  [
    { name: "팬5", message: "펀딩 목표액이 얼마나 되나요?" },
    {
      name: "유튜버",
      message:
        "펀딩에 참여해주시는 분들께 감사의 마음을 담아 굿즈도 준비중입니다.",
    },
    { name: "팬6", message: "저도 펀딩 참여하겠습니다! 기대하겠습니다." },
  ],
  [
    { name: "팬8", message: "이번 펀딩 정말 기대되네요." },
    {
      name: "유튜버",
      message: "여러분의 관심에 힘입어 펀딩을 준비하고 있습니다. 감사합니다.",
    },
    { name: "팬9", message: "펀딩 참여해서 굿즈 꼭 받고 싶어요!" },
  ],
  [
    { name: "그림매니아", message: "펀딩에 성공하시길 바랍니다!" },
    {
      name: "유튜버",
      message: "펀딩에 참여해주신 모든 분들께 진심으로 감사드립니다.",
    },
    { name: "팬12", message: "펀딩 성공 기원합니다!" },
  ],
];

export interface ImageUrl {
  image_url: string;
}

export interface Writer {
  id: number;
  name: string;
}

export interface IFeed {
  content: string;
  created_time: null | string; // Adjust as per your requirements
  id: number;
  image_urls: ImageUrl[];
  tag: string;
  writer: Writer;
}

export interface IFunding {
  id: number;
  writer: Writer;
  title: string;
  content: string;
  tag: string;
  requested_num: number;
  created_time: string;
  finished_time: string;
  influencer: string;
  image_urls: ImageUrl[];
}
